/*
Дезоксирибонуклеїнова кислота, ДНК - це основна молекула зберігання інформації в біологічних системах. Вона складається з чотирьох основ нуклеїнових кислот: гуаніну ('G'), цитозину ('C'), аденіну ('A') і тиміну ('T').
Рибонуклеїнова кислота, РНК, є основною молекулою-месенджером у клітинах. РНК дещо відрізняється від ДНК своєю хімічною структурою і не містить тиміну. У РНК тимін замінений іншою нуклеїновою кислотою - урацилом ('U').
Створіть функцію, яка переводить заданий рядок ДНК в РНК.
Наприклад:
"GCAT" => "GCAU"
Вхідний рядок може бути довільної довжини - зокрема, він може бути порожнім. Гарантується, що всі вхідні дані є коректними, тобто кожен вхідний рядок буде складатися лише з 'G', 'C', 'A' та/або 'T'.
*/

#include<iostream>
#include<string>

using namespace std;

string DNAtoRNA(string dna){
    
    string dna_T = "T";
    size_t found = dna.find(dna_T);
    string rna_U = "U";
    
    while (found != string::npos){
        dna.replace(found, 1, rna_U);
        found = dna.find(dna_T, found + 1);
    }

  return dna;
}

int main(){
   
    string dna = "GCTAAA";
    cout << DNAtoRNA(dna) << endl;

    return 0;
}