/*
Після важкого кварталу в офісі ви вирішили відпочити у відпустці. Ви бронюєте авіаквиток для себе та своєї дівчини і намагаєтесь залишити весь цей безлад позаду.
Для того, щоб пересуватися у відпустці, вам знадобиться автомобіль напрокат. Менеджер автопрокату робить вам кілька вигідних пропозицій.
Кожен день оренди автомобіля коштує $40. Якщо ви орендуєте автомобіль на 7 або більше днів, ви отримуєте знижку в розмірі $50. Або ж, якщо ви орендуєте автомобіль на 3 або більше днів, ви отримуєте знижку $20 від загальної суми.
Напишіть код, який виводить загальну суму для різних днів(d).
Translated with DeepL.com (free version)
*/
#include<iostream>

using namespace std;

int rental_car_cost(int d){

    int sum_d = 0;
    int price = 40;
    int discont1 = 50;
    int discont2 = 20;

    if (d >= 7) {
        sum_d = (d * price) - discont1;
    } else if ( d >= 3){
        sum_d = (d * price) - discont2;
    } else {
        sum_d = (d * price);
    }

  return sum_d ;
}

int main(){

    int day = 5;

    rental_car_cost(day);

}
